import React from 'react';
import "./style.scss"
import Link from 'next/link';
import Image from 'next/image';

const newsArray = [
    {
        img: "https://campuslive24.com/news/maradona-cl_2023-05-24-18-44-20.jpg",
        title: "ম্যারাডোনার ফেসবুক অ্যাকাউন্ট হ্যাক",
        description: "ম্যারাডোনার ফেসবুক অ্যাকাউন্ট হ্যাক  ম্যারাডোনার ফেসবুক অ্যাকাউন্ট হ্যাক  আর্জেন্টিনার কিংবদন্তি ফুটবলার ডিয়োগো ম্যারাডোনার ফেসবুক অ্যাকাউন্ট হ্যাক হয়েছে। দেশটির নির্ভরযোগ্য সংবাদমাধ্যম টিওয়াইসি স্পোর্টস তাদের প্রতিবেদনে এ খ"
    },
    {
        img: "https://campuslive24.com/feature_img_mini/mehdi_2023-05-21-19-02-39.jpg",
        title: "ইংলিশ কাউন্টি লিগে খেলার প্রস্তাব পেলেন মিরাজ",
        description: "ইংলিশ কাউন্টি দল ওয়ারউইকশায়ারের হয়ে ৫০ ওভারের একটি লিগ খেলার প্রস্তাব পেয়েছেন বাংলাদেশের অন্যতম তারকা ক্রিকেটার মেহেদী হাসান মিরাজ। ইংলিশ কাউন্টি দলে খেলার প্রস্তাব পাওয়ার বিষয়টি নিজেই নিশ্চিত করেছেন মিরাজ। জাতীয় দলের কোনও ম্যাচ না থাকলে আগামী আগস্টে শুরু হতে যাওয়া এই আসরে খেলবেন তিনি। মূলত গেল ঢাকা প্রিমিয়ার ডিভিশন লিগে মোহামেডানে মিরাজের সঙ্গে খেলা জ্যাক লিনটটের মাধ্যমে এই প্রস্তাব পান বাংলাদেশের এই অলরাউন্ডার।"
    },
    {
        img: "https://campuslive24.com/feature_img_mini/mehdi_2023-05-21-19-02-39.jpg",
        title: "ইংলিশ কাউন্টি লিগে খেলার প্রস্তাব পেলেন মিরাজ",
        description: "ইংলিশ কাউন্টি দল ওয়ারউইকশায়ারের হয়ে ৫০ ওভারের একটি লিগ খেলার প্রস্তাব পেয়েছেন বাংলাদেশের অন্যতম তারকা ক্রিকেটার মেহেদী হাসান মিরাজ। ইংলিশ কাউন্টি দলে খেলার প্রস্তাব পাওয়ার বিষয়টি নিজেই নিশ্চিত করেছেন মিরাজ। জাতীয় দলের কোনও ম্যাচ না থাকলে আগামী আগস্টে শুরু হতে যাওয়া এই আসরে খেলবেন তিনি। মূলত গেল ঢাকা প্রিমিয়ার ডিভিশন লিগে মোহামেডানে মিরাজের সঙ্গে খেলা জ্যাক লিনটটের মাধ্যমে এই প্রস্তাব পান বাংলাদেশের এই অলরাউন্ডার।"
    },
    {
        img: "https://campuslive24.com/feature_img_mini/mehdi_2023-05-21-19-02-39.jpg",
        title: "ইংলিশ কাউন্টি লিগে খেলার প্রস্তাব পেলেন মিরাজ ইংলিশ কাউন্টি লিগে খেলার প্রস্তাব পেলেন মিরাজ",
        description: "ইংলিশ কাউন্টি দল ওয়ারউইকশায়ারের হয়ে ৫০ ওভারের একটি লিগ খেলার প্রস্তাব পেয়েছেন বাংলাদেশের অন্যতম তারকা ক্রিকেটার মেহেদী হাসান মিরাজ। ইংলিশ কাউন্টি দলে খেলার প্রস্তাব পাওয়ার বিষয়টি নিজেই নিশ্চিত করেছেন মিরাজ। জাতীয় দলের কোনও ম্যাচ না থাকলে আগামী আগস্টে শুরু হতে যাওয়া এই আসরে খেলবেন তিনি। মূলত গেল ঢাকা প্রিমিয়ার ডিভিশন লিগে মোহামেডানে মিরাজের সঙ্গে খেলা জ্যাক লিনটটের মাধ্যমে এই প্রস্তাব পান বাংলাদেশের এই অলরাউন্ডার।"
    },
    {
        img: "https://campuslive24.com/feature_img_mini/mehdi_2023-05-21-19-02-39.jpg",
        title: "ইংলিশ কাউন্টি লিগে খেলার প্রস্তাব পেলেন মিরাজ",
        description: "ইংলিশ কাউন্টি দল ওয়ারউইকশায়ারের হয়ে ৫০ ওভারের একটি লিগ খেলার প্রস্তাব পেয়েছেন বাংলাদেশের অন্যতম তারকা ক্রিকেটার মেহেদী হাসান মিরাজ। ইংলিশ কাউন্টি দলে খেলার প্রস্তাব পাওয়ার বিষয়টি নিজেই নিশ্চিত করেছেন মিরাজ। জাতীয় দলের কোনও ম্যাচ না থাকলে আগামী আগস্টে শুরু হতে যাওয়া এই আসরে খেলবেন তিনি। মূলত গেল ঢাকা প্রিমিয়ার ডিভিশন লিগে মোহামেডানে মিরাজের সঙ্গে খেলা জ্যাক লিনটটের মাধ্যমে এই প্রস্তাব পান বাংলাদেশের এই অলরাউন্ডার।"
    },
    {
        img: "https://campuslive24.com/feature_img_mini/mehdi_2023-05-21-19-02-39.jpg",
        title: "ইংলিশ কাউন্টি লিগে খেলার প্রস্তাব পেলেন মিরাজ",
        description: "ইংলিশ কাউন্টি দল ওয়ারউইকশায়ারের হয়ে ৫০ ওভারের একটি লিগ খেলার প্রস্তাব পেয়েছেন বাংলাদেশের অন্যতম তারকা ক্রিকেটার মেহেদী হাসান মিরাজ। ইংলিশ কাউন্টি দলে খেলার প্রস্তাব পাওয়ার বিষয়টি নিজেই নিশ্চিত করেছেন মিরাজ। জাতীয় দলের কোনও ম্যাচ না থাকলে আগামী আগস্টে শুরু হতে যাওয়া এই আসরে খেলবেন তিনি। মূলত গেল ঢাকা প্রিমিয়ার ডিভিশন লিগে মোহামেডানে মিরাজের সঙ্গে খেলা জ্যাক লিনটটের মাধ্যমে এই প্রস্তাব পান বাংলাদেশের এই অলরাউন্ডার।"
    },
    {
        img: "https://campuslive24.com/feature_img_mini/mehdi_2023-05-21-19-02-39.jpg",
        title: "ইংলিশ কাউন্টি লিগে খেলার প্রস্তাব পেলেন মিরাজ",
        description: "ইংলিশ কাউন্টি দল ওয়ারউইকশায়ারের হয়ে ৫০ ওভারের একটি লিগ খেলার প্রস্তাব পেয়েছেন বাংলাদেশের অন্যতম তারকা ক্রিকেটার মেহেদী হাসান মিরাজ। ইংলিশ কাউন্টি দলে খেলার প্রস্তাব পাওয়ার বিষয়টি নিজেই নিশ্চিত করেছেন মিরাজ। জাতীয় দলের কোনও ম্যাচ না থাকলে আগামী আগস্টে শুরু হতে যাওয়া এই আসরে খেলবেন তিনি। মূলত গেল ঢাকা প্রিমিয়ার ডিভিশন লিগে মোহামেডানে মিরাজের সঙ্গে খেলা জ্যাক লিনটটের মাধ্যমে এই প্রস্তাব পান বাংলাদেশের এই অলরাউন্ডার।"
    },
]

const Sports = () => {
    return (
        <section className="container sport-debate-container">
            <div className='sports-section'>
                <div className='title'>
                    <h4> খেলা </h4>
                </div>
                <div className='news-container'>
                    {
                        [...newsArray].slice(0, 7).map((news, index) => {
                            return <Link className='news-cart' href={"/"} key={index}>
                                <Image src={news.img} height={100} width={100} alt='' />
                                <div>
                                    <h2> {news.title}</h2>
                                    <p>{news.description.slice(0, 64)}</p>
                                </div>
                            </Link>
                        })
                    }
                </div>

            </div>
            <div className="debate-section">
                <div className='title'>
                    <h4>মত-দ্বিমত </h4>
                </div>
                <div className='news-container'>
                    {
                        [...newsArray].slice(0, 5).map((news, index) => {
                            return <Link className='news-cart' href={"/"} key={index}>
                                <div>
                                    <h2> {news.title}</h2>
                                    <p>{news.description.slice(0, 64)}</p>
                                </div>
                                <Image src={news.img} height={100} width={100} alt='' />
                            </Link>
                        })
                    }
                </div>
            </div>
        </section>
    );
};

export default Sports;