import React from 'react';

const Home = () => {
  let container = `<p>শুরু হয়েছে পাঁচ দিনব্যাপী শারদীয় দুর্গাপূজা। এ উপলক্ষে পশ্চিমবঙ্গে গতকাল মুক্তি পেয়েছে তিন সিনেমা। সিনেমাগুলোতে দেখা গেছে জনপ্রিয় অভিনয়শিল্পীদের।</p><p><strong>সৃজিতের ‘টেক্কা’<br></strong> এবার পুজোর অন্যতম প্রতীক্ষিত ছবি হলো ‘টেক্কা’। সৃজিত মুখোপাধ্যায় পরিচালিত দেব এন্টারটেইনমেন্ট ভেঞ্চারস প্রযোজিত ছবিটিতে প্রধান চরিত্রে রয়েছেন দেব, স্বস্তিকা মুখোপাধ্যায় ও রুক্মিণী মৈত্র। </p><p>বেশ অনেক দিন পর আবারও একটি থ্রিলার অ্যাকশন ছবিতে দেখা যাবে দেবকে। নিজের চাকরি ফেরত পেতে এক স্কুলছাত্রীকে অপহরণ করে ইকলাখ ওরফে দেব। ট্রেলারেই উত্তেজনা বাড়িয়েছে ‘টেক্কা’, মুক্তির পর থেকেই দর্শক-সমালোচকের প্রশংসা পাচ্ছে সিনেমাটি। আর কিছুদিন পরে বোঝা যাবে বক্স অফিসে অন্য সিনেমাগুলোকে টেক্কা দিতে পেরেছে কি না সিনেমাটি।</p><p><strong>পথিকৃতের ‘শাস্ত্রী’<br></strong>এবার বক্স অফিসে মুখোমুখি থাকছেন মিঠুন চক্রবর্তী ও দেব। দীর্ঘদিন পর দেবশ্রী রায়ের সঙ্গে জুটি বেঁধেছেন ‘মহাগুরু’। </p><p>‘শাস্ত্রী’ হয়ে ফিরেছেন মিঠুন। ছবির গল্প অনুযায়ী, খুবই জ্যোতিষ বিশ্বাসী মিঠুনের চরিত্রটি। একসময় নানা ঘটনার পর ছা-পোষা মধ্যবিত্ত থেকে শাস্ত্রী হয়ে ওঠেন তিনি। </p><p>ছবিতে মিঠুন দেবশ্রী ছাড়াও গুরুত্বপূর্ণ চরিত্রে রয়েছেন সোহম চক্রবর্তী। পথিকৃৎ বসু পরিচালিত ছবিটি প্রযোজনার দায়িত্বে রয়েছেন সুরিন্দর ফিল্মস এবং সোহমস এন্টারটেইনমেন্ট অ্যান্ড ক্রিয়েটিভ সলিউশনস।</p><p><strong>নন্দিতা-শিবপ্রসাদের ‘বহুরূপী’<br></strong>গত বছর থেকে পুজোয় ছবি মুক্তি দিচ্ছে প্রযোজনা সংস্থা উইন্ডোজ প্রোডাকশন। গত বছরের আলোচিত ‘রক্তবীজ’-এর পর এবার তাঁদের পরিবেশনা ‘বহুরূপী’। দীর্ঘদিন পর পরিচালনার সঙ্গে সঙ্গে অভিনয়ও করেছেন শিবপ্রসাদ মুখোপাধ্যায়। </p><p>রয়েছেন কৌশানী মুখোপাধ্যায়, আবির চট্টোপাধ্যায় এবং ঋতাভরী চক্রবর্তী। ১৯৯৮ থেকে ২০০৫ পর্যন্ত সময়ের প্রেক্ষাপট তুলে ধরা হবে ছবিতে। এ ছবিটিও মুক্তির পর প্রশংসিত হচ্ছে।</p>`
  // container = `<p>পাঁচ দিনব্যাপী শারদীয় দুর্গাপূজার আনুষ্ঠানিকতা শুরু হয়েছে। এই উপলক্ষে পশ্চিমবঙ্গের সিনেমা হলগুলোতে গতকাল তিনটি নতুন সিনেমা মুক্তি পেয়েছে, যেখানে দর্শকদের জনপ্রিয় শিল্পীদের অভিনয় দেখা গেছে।</p>
  // <p><strong>সৃজিতের ‘টেক্কা’<br></strong>এবার পুজোর সময়ে মুক্তি পাওয়া অন্যতম প্রত্যাশিত ছবি ‘টেক্কা’। সৃজিত মুখোপাধ্যায় পরিচালিত এবং দেব এন্টারটেইনমেন্ট ভেঞ্চারসের প্রযোজনায় নির্মিত ছবিটিতে প্রধান চরিত্রে রয়েছেন দেব, স্বস্তিকা মুখোপাধ্যায় ও রুক্মিণী মৈত্র।</p>
  // <p>দীর্ঘদিন পর দেবকে আবারও একটি থ্রিলার অ্যাকশন ছবিতে দেখা যাবে। ছবির কাহিনী অনুযায়ী, চাকরি ফিরে পেতে এক স্কুলছাত্রীকে অপহরণ করে দেব। ট্রেলারটি দর্শকদের মধ্যে উত্তেজনা সৃষ্টি করেছে, এবং মুক্তির পর সিনেমাটি দর্শক ও সমালোচকদের প্রশংসা পাচ্ছে। কিছুদিনের মধ্যে বোঝা যাবে, বক্স অফিসে অন্যান্য সিনেমাগুলোর সঙ্গে টেক্কা কতটা প্রতিযোগিতা করতে সক্ষম হয়েছে।</p>
  // <p><strong>পথিকৃতের ‘শাস্ত্রী’<br></strong>বক্স অফিসে এবার মিঠুন চক্রবর্তী ও দেবের মুখোমুখি হওয়া দেখা যাবে। দীর্ঘদিন পরে দেবশ্রী রায়ের সঙ্গে জুটি বেঁধেছেন ‘মহাগুরু’।</p>
  // <p>মিঠুন ‘শাস্ত্রী’ চরিত্রে ফিরে এসেছেন। ছবির গল্প অনুযায়ী, মিঠুনের চরিত্রটি অত্যন্ত জ্যোতিষ বিশ্বাসী। নানা ঘটনাবলী পরে তিনি মধ্যবিত্ত থেকে শাস্ত্রীতে পরিণত হন।</p>
  // <p>ছবিতে মিঠুন এবং দেবশ্রী ছাড়াও গুরুত্বপূর্ণ চরিত্রে রয়েছেন সোহম চক্রবর্তী। পথিকৃত বসু পরিচালিত এই ছবিটি প্রযোজনা করেছেন সুরিন্দর ফিল্মস এবং সোহমস এন্টারটেইনমেন্ট অ্যান্ড ক্রিয়েটিভ সলিউশনস।</p>
  // <p><strong>নন্দিতা-শিবপ্রসাদের ‘বহুরূপী’<br></strong>গত বছর থেকে পুজোতে সিনেমা মুক্তি দিচ্ছে উইন্ডোজ প্রোডাকশন। গত বছরের আলোচিত ‘রক্তবীজ’-এর পর এবার তাঁদের নতুন পরিবেশনা ‘বহুরূপী’। শিবপ্রসাদ মুখোপাধ্যায় দীর্ঘদিন পর পরিচালনার পাশাপাশি অভিনয়ও করছেন।</p>
  // <p>ছবিতে রয়েছেন কৌশানী মুখোপাধ্যায়, আবির চট্টোপাধ্যায় এবং ঋতাভরী চক্রবর্তী। ১৯৯৮ থেকে ২০০৫ সালের সময়ের প্রেক্ষাপট ফুটিয়ে তোলা হয়েছে ছবিটিতে। মুক্তির পর এই ছবিটিও দর্শকদের কাছে প্রশংসিত হচ্ছে।</p>
  // `



  return (

    <div
      dangerouslySetInnerHTML={{ __html: container }}
    />
  );
};

export default Home;
